
&НаКлиенте
Procedure ТоварыКоличествоOnChange(Item)
	ТекущиеДанные = Элементы.Товары.CurrentData;
	ПересчитатьСуммуВСтроке(ТекущиеДанные);		
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ТекущиеДанные = Элементы.Товары.CurrentData;
	ПересчитатьСуммуВСтроке(ТекущиеДанные);	
EndProcedure

&НаКлиенте
Процедура ПересчитатьСуммуВСтроке(ТекущиеДанные)
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	ПересчитатьСуммуДокумента();	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуДокумента()

	Object.СуммаДокумента = Object.Товары.Total("Сумма"); 

КонецПроцедуры
